export default {
  buttonLabel_one: 'ИИ-помощник: {{count}} подсказка',
  buttonLabel_few: 'ИИ-помощник: {{count}} подсказки',
  buttonLabel_many: 'ИИ-помощник: {{count}} подсказок',
  buttonLabel_other: 'ИИ-помощник: {{count}} подсказки',
  listLabel: 'Подсказки',
  doIt: 'Выполнить',
  dismiss: 'Скрыть',
  moduleIntro: {
    card: {
      designer: 'Впервые в конструкторе форм? Спросите меня, как он работает.',
      data: 'Впервые в модуле «Данные»? Спросите меня, как он работает.',
      analysis: 'Впервые в модуле «Анализ»? Спросите меня, как он работает.',
    },
  },
  missingTranslations: {
    card_one: 'Отсутствует {{count}} текст на языке «{{language}}». Перевести его?',
    card_few: 'Отсутствуют {{count}} текста на языке «{{language}}». Перевести их?',
    card_many: 'Отсутствуют {{count}} текстов на языке «{{language}}». Перевести их?',
    card_other: 'Отсутствуют {{count}} текста на языке «{{language}}». Перевести их?',
  },
  newEntriesDescriptions: {
    card_one: 'Вы добавили {{count}} элемент без описания. Написать описания на всех языках?',
    card_few: 'Вы добавили {{count}} элемента без описания. Написать описания на всех языках?',
    card_many: 'Вы добавили {{count}} элементов без описания. Написать описания на всех языках?',
    card_other: 'Вы добавили {{count}} элемента без описания. Написать описания на всех языках?',
  },
  entityWithoutKey: {
    cardSingle: 'У {{name}} нет ключевого атрибута. Предложить его?',
    card_one: '{{count}} сущность без ключевого атрибута. Предложить ключи?',
    card_few: '{{count}} сущности без ключевого атрибута. Предложить ключи?',
    card_many: '{{count}} сущностей без ключевого атрибута. Предложить ключи?',
    card_other: '{{count}} сущности без ключевого атрибута. Предложить ключи?',
  },
}
