export default {
  buttonLabel_one: 'Хиймэл оюуны туслах: {{count}} санал',
  buttonLabel_other: 'Хиймэл оюуны туслах: {{count}} санал',
  listLabel: 'Саналууд',
  doIt: 'Гүйцэтгэх',
  dismiss: 'Хаах',
  moduleIntro: {
    card: {
      designer: 'Маягтын зохиогчийг анх удаа ашиглаж байна уу? Хэрхэн ажилладгийг надаас асуугаарай.',
      data: 'Өгөгдлийн модулийг анх удаа ашиглаж байна уу? Хэрхэн ажилладгийг надаас асуугаарай.',
      analysis: 'Шинжилгээний модулийг анх удаа ашиглаж байна уу? Хэрхэн ажилладгийг надаас асуугаарай.',
    },
  },
  missingTranslations: {
    card_one: '{{language}} хэл дээр {{count}} текст дутуу байна. Орчуулах уу?',
    card_other: '{{language}} хэл дээр {{count}} текст дутуу байна. Орчуулах уу?',
  },
  newEntriesDescriptions: {
    card_one: 'Та тайлбаргүй {{count}} зүйл нэмсэн байна. Бүх хэл дээр тайлбар бичих үү?',
    card_other: 'Та тайлбаргүй {{count}} зүйл нэмсэн байна. Бүх хэл дээр тайлбар бичих үү?',
  },
  entityWithoutKey: {
    cardSingle: '{{name}}-д түлхүүр шинж чанар алга. Санал болгох уу?',
    card_one: '{{count}} нэгжид түлхүүр шинж чанар алга. Түлхүүр санал болгох уу?',
    card_other: '{{count}} нэгжид түлхүүр шинж чанар алга. Түлхүүр санал болгох уу?',
  },
  attributeWithoutRef: {
    cardCategory: '{{name}}-д ангилал алга. Сонгох уу?',
    cardTaxonomy: '{{name}}-д таксоном алга. Сонгох уу?',
    card_one: '{{count}} шинж чанарт ангилал эсвэл таксоном алга. Сонгох уу?',
    card_other: '{{count}} шинж чанарт ангилал эсвэл таксоном алга. Сонгох уу?',
  },
  publishErrors: {
    card_one: '{{count}} зүйлд алдаа байна. Нийтлэх амжилтгүй болно. Засах уу?',
    card_other: '{{count}} зүйлд алдаа байна. Нийтлэх амжилтгүй болно. Засах уу?',
  },
  categoryItemTranslations: {
    card_one: '{{language}} хэл дээр ангиллын {{count}} шошго дутуу байна. Орчуулах уу?',
    card_other: '{{language}} хэл дээр ангиллын {{count}} шошго дутуу байна. Орчуулах уу?',
  },
  validationErrors: {
    card: 'Энэ мөчлөгт баталгаажуулалтын мессеж: {{count}}. Нийтлэг хэв маягийг нэгтгэн дүгнэх үү?',
  },
  dataImported: {
    card: 'Импортолсон бичлэг: {{count}}. Товч тойм харах уу?',
    cardOne: '1 бичлэг импортоллоо. Товч тойм харах уу?',
  },
}
