export default {
  buttonLabel_one: 'Хиймэл оюуны туслах: {{count}} санал',
  buttonLabel_other: 'Хиймэл оюуны туслах: {{count}} санал',
  listLabel: 'Саналууд',
  doIt: 'Гүйцэтгэх',
  dismiss: 'Хаах',
  moduleIntro: {
    card: {
      designer: 'Маягтын зохиогчийг анх удаа ашиглаж байна уу? Хэрхэн ажилладгийг надаас асуугаарай.',
      data: 'Өгөгдлийн модулийг анх удаа ашиглаж байна уу? Хэрхэн ажилладгийг надаас асуугаарай.',
      analysis: 'Шинжилгээний модулийг анх удаа ашиглаж байна уу? Хэрхэн ажилладгийг надаас асуугаарай.',
    },
  },
  missingTranslations: {
    card_one: '{{language}} хэл дээр {{count}} текст дутуу байна. Орчуулах уу?',
    card_other: '{{language}} хэл дээр {{count}} текст дутуу байна. Орчуулах уу?',
  },
}
